Catalogs/бит_ТаблицыШаблоновГИСЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ТаблицыШаблоновГИСЖКХ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияТаблицы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/бит_СКДТаблицГИСЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СКДТаблицГИСЖКХ</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СхемаКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Редактор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТаблицаШаблонаГИСЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТаблицыШаблоновГИСЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/бит_ТаблицыШаблоновГИСЖКХ/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СхемыКомпоновкиДанных.Параметры.УстановитьЗначениеПараметра("ТаблицаШаблонаГИСЖКХ", Объект.Ссылка);
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		
		Объект.Наименование	= Объект.Наименование + " (Свой вариант)" ;
		Объект.Комментарий	= "Создано копированием.";
		
		ТекстСообщения = НСтр("ru = 'Для копирования схемы компоновки данных необходимо записать элемент справочника.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		ЗначениеКопирования = Параметры.ЗначениеКопирования;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ЗначениеКопирования) Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТаблицаШаблонаГИСЖКХ", ЗначениеКопирования);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	бит_СКДТаблицГИСЖКХСрезПоследних.СхемаКомпоновкиДанных
		|ИЗ
		|	РегистрСведений.бит_СКДТаблицГИСЖКХ.СрезПоследних(, ТаблицаШаблонаГИСЖКХ = &ТаблицаШаблонаГИСЖКХ) КАК бит_СКДТаблицГИСЖКХСрезПоследних";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			Набор = РегистрыСведений.бит_СКДТаблицГИСЖКХ.СоздатьНаборЗаписей();
			Набор.Прочитать();
			Период = ТекущаяДата();
			
			НовыйНабор						= Набор.Добавить();
			НовыйНабор.Период				= Период;
			НовыйНабор.ТаблицаШаблонаГИСЖКХ	= ТекущийОбъект.Ссылка;
			НовыйНабор.Комментарий			= "Создано копированием.";
			НовыйНабор.Редактор				= бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
			
			СКД = Выборка.СхемаКомпоновкиДанных.Получить();
			СхемаКомпоновкиДанных = бит_ОбщегоНазначенияКлиентСервер.ПодготовитьСхемуСКД(СКД);
			НовыйНабор.СхемаКомпоновкиДанных = Новый ХранилищеЗначения(СхемаКомпоновкиДанных);
			
			Попытка
				Набор.Записать();
			Исключение
				ТекстСообщения = НСтр("ru = 'Ошибка записи СКД. Таблица создана без схемы компоновки данных!'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецПопытки;
			
		Иначе
			ТекстСообщения = НСтр("ru = 'Таблица создана без схемы компоновки данных!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
		ЗначениеКопирования = Справочники.бит_ТаблицыШаблоновГИСЖКХ.ПустаяСсылка();
		
	КонецЕсли;
	
	СхемыКомпоновкиДанных.Параметры.УстановитьЗначениеПараметра("ТаблицаШаблонаГИСЖКХ", Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Создать(Команда)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ЗначенияЗаполнения = Новый Структура("ТаблицаШаблонаГИСЖКХ", Объект.Ссылка);
		ОткрытьФорму("РегистрСведений.бит_СКДТаблицГИСЖКХ.ФормаЗаписи", Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения), ЭтаФорма);
	Иначе
		
		ТекстСообщения = НСтр("ru = 'Перед добавлением новой записи, необходимо сохранить новый элемент справочника.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
